# UIMacroManager Properties

---
The UIMacroManager type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| MacroManager|  The DB macro manager.
Top
#### Reference
UIMacroManager Class
Autodesk.Revit.UI.Macros Namespace